#pragma once
#include "iostream"
#include "Windows.h"
#include "conio.h"
#include <string>
#include <fstream>
#include <time.h>
#include <stdio.h>

using namespace std;

#include "File_checker.h"

/*
Створити версії прогами на Сі
(за допомогою структур та класів)
та Сі++(за допомогою шаблонів та класів) :
Створити сім’ю класів ЛЮДИНА – ПОКУПЕЦЬ, 
ПРОДАВЕЦЬ – КЕРІВНИК МАГАЗИНУ.
Промоделювати процес продажу - купівлі 
класу ТОВАР за допомогою випадкового 
процесу купівлі для даного МАГАЗИНУ.
Закупівля товару також йде випадковим чином.
Врахувати обмеженість складу товару та 
обсягу обороту. Дані по складу МАГАЗИНУ 
та по працівникам і покупцям зберігаються 
в бінарних файлах певного формату.
Для роботи з цим форматом потрібно 
створити окрему бібліотеку, 
що передбачає для користувача можливість 
гарно працювати з цією БД(модифікація, 
видалення, додавання даних).
Введення / виведення даних з екрану та з файлу.
Зарплата Продавця залежить від кількості 
проданого ним товару та отриманого ним 
прибутку. Оптовим та постійним Покупцям є 
можливі знижки, що повинні враховуватися. 
Для деяких видів товару вартість знижується(уцінка) 
з часом. Обчислити прибуток / збиток магазину 
за деякий час.Показати стан МАГАЗИНУ(список 
товарів в наявності, продано та отримано 
за невеличкий проміжок часу, список продавців 
та їх здобутки).
*/